Revit 2027 API
RebarConstraint.IsFixedDistanceToHostFace Method
 Checks if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFixedDistanceToHostFace()
Public Function IsFixedDistanceToHostFace As Boolean
public:
bool IsFixedDistanceToHostFace()
member IsFixedDistanceToHostFace : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace', false otherwise.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace